{
    "title": "Running secure enterprise workloads",
    "lastupdated": "2023-11-06",
    "introduction": "Use IBM Cloud enterprises and a variety of tools and products to securely develop, deploy, and manage your regulated, mission-critical enterprise workloads in the cloud.",
    "section_recommended": [
      {
        "title": "Setting up an enterprise",
        "description": "Learn how to create an enterprise, add accounts and organize them in account groups, invite users, and explore subscriptions.",
        "href": "/docs/secure-enterprise?topic=secure-enterprise-enterprise-tutorial"
      },
      {
        "title": "Using projects for IaC deployments",
        "description": "Learn how to manage resources and Infrastructure as Code (IaC) deployments with projects, which enable teams to configure, deploy, and monitor deployments by using DevOps best practices.",
        "href": "/docs/secure-enterprise?topic=secure-enterprise-understanding-projects"
      },
      {
        "title": "Use DevSecOps to set up a secure software supply chain",
        "description": "Leverage DevSecOps toolchains to automate the integration of security at every phase of the software development lifecycle.",
        "href": "/docs/secure-enterprise?topic=secure-enterprise-secure-software-supply-chain"
      },
      {
        "title": "Ensure continuous compliance and stay audit-ready",
        "description": "Leverage IBM Cloud tools to ensure the workloads deployed in your enterprise always meet your regulatory and compliance standards.",
        "href": "/docs/secure-enterprise?topic=secure-enterprise-continuous-compliance"
      },
      {
        "title": "Customize and extend IBM Cloud deployable architectures",
        "description": "Start with an IBM Cloud deployable architecture and customize it to meet your needs.",
        "href": "/docs/secure-enterprise?topic=secure-enterprise-customize-from-catalog"
      },
      {
        "title": "Onboard approved software and deployable architectures to private catalogs",
        "description": "You can customize what products are available from the catalog for users in your enterprise to ensure that only approved architectures that adhere to your compliance standards are deployed.",
        "href": "/docs/secure-enterprise?topic=secure-enterprise-onboard-custom"
      }
    ],
    "section_videos": [
      {
        "title": "Introducing IBM Cloud enterprises",
        "href": "/docs/secure-enterprise?topic=secure-enterprise-what-is-enterprise#watch-and-learn",
        "thumbnail": "/images/landing-Introducing-IBM-Cloud-enterprises.png"
      },
      {
        "title": "Security and compliance for regulated workloads on IBM Cloud",
        "href": "/docs/secure-enterprise?topic=secure-enterprise-continuous-compliance",
        "thumbnail": "/images/landing-secure-compliant.png"
      },
      {
        "title": "IBM Cloud Console Guide: Getting Access - Role Overview",
        "href": "/docs/account?topic=account-cloudaccess#watch-iamaccess",
        "thumbnail": "/images/landing-Getting-Access-Role-Overview.png"
      }
    ],
    "section_learn": {
      "developer": "https://developer.ibm.com/depmodels/cloud/gettingstarted/",
      "architecture": "https://www.ibm.com/cloud/architecture/architectures/public-cloud",
      "training": "https://www.ibm.com/training/cloud",
      "community": "https://community.ibm.com/community/user/cloud/home"
    },
    "section_updates": {
      "view_more": "/docs/overview?topic=overview-whatsnew",
      "tiles": [
        {
          "date": "06 November 2023",
          "title": "Configure scipts for your deployable architecture",
          "description": "When creating or updating your deployable architecture, you can add scripts to run before and after you validate, deploy, and undeploy your project."
        },
        {
          "date": "06 November 2023",
          "title": "Introducing environments and general improvements to projects API and CLI",
          "description": "You can now group configurations together within a project by using environments. Environments can also contain properties like input values that are automatically added to configurations. This release also includes updates to the projects API and CLI. The commands are normalized so they follow a regular pattern, and terminology is now aligned across our UI, CLI, and API."
        },
        {
          "date": "25 July 2023",
          "title": "Projects integration with IBM Cloud Schematics and general improvements",
          "description": "Projects are integrated more seamlessly with Schematics, as users can now view the Schematics logs directly from their project during validation and deployment. This release also includes system improvements to deleting a project. A recent update to the Code Risk Analyzer might result in fewer validation errors for deployable architectures that include Event Streams resources."
        }
      ]
    }
  }
